import Section from "@/templates/Section";
import { Box, Container, Typography } from "@mui/material";
import React from "react";

const NetworkFour = () => {
  const paragraphs = [
    {
      id: 1,
      title:
        "هناك العديد من العوامل التي يجب مراعاتها عند تصميم امتدادات الشبكة، بما في ذلك:",
      points: [
        "فحص موقع وطريقة ومسار التمديدات.",
        "يجب أن يكون تصميم امتداد الشبكة قادرًا على دعم حجم الشبكة الحالي والمستقبلي.",
        "الاتفاق على أنواع المواد الخام والأجهزة.",
        "نوع التطبيقات التي سيتم استخدامها.",
        "الميزانية.",
      ],
    },
    {
      id: 2,
      title: "هناك العديد من الطرق لصيانة الشبكات، وفيما يلي بعض منها:",
      points: [
        "فحص الكابلات: يجب فحص الكابلات بحثًا عن أي تلف، مثل الكسور أو الخدوش أو القطع. إذا تم العثور على أي ضرر، يجب استبدال الكابل.",
        "أجهزة التنظيف: يجب تنظيف الأجهزة بانتظام لإزالة الغبار والأوساخ التي يمكن أن تسبب ارتفاع درجة الحرارة أو أعطالها.",
        "تحديث البرامج الثابتة: يجب تحديث البرامج الثابتة للجهاز بانتظام لإصلاح أي أخطاء وتحسين الأداء.",
        "مراقبة الأداء: يجب مراقبة أداء الشبكة بانتظام للبحث عن أي مشاكل. إذا تم العثور على أي مشاكل، فيجب حلها على الفور.",
        "إنشاء خطة صيانة: يجب إنشاء خطة صيانة تحدد جدول الصيانة الدورية للشبكة.",
        "تدريب الموظفين على كيفية استخدام الشبكة بأمان وفعالية: ينبغي تدريب الموظفين على كيفية استخدام الشبكة بأمان وفعالية، بما في ذلك كيفية الإبلاغ عن الأعطال.",
        "إنشاء نظام للإبلاغ عن الأعطال والمشكلات: يجب عليك إنشاء نظام للإبلاغ عن الأعطال ومشاكل الشبكة حتى يمكن إصلاحها على الفور.",
        "تحديث الأجهزة والبرامج بانتظام: يجب تحديث الأجهزة والبرامج بانتظام لإصلاح أي أخطاء وتحسين الأداء.",
        "قم بعمل نسخة احتياطية لبياناتك بانتظام: يجب عليك عمل نسخة احتياطية لبياناتك بانتظام للحماية من فقدان البيانات في حالة فشل الشبكة.",
      ],
    },

    {
      id: 4,
      title: "فيما يلي بعض فوائد صيانة أجهزة الشبكة:",
      points: [
        "تقليل الأعطال: من خلال صيانة معدات تكنولوجيا المعلومات بانتظام، يمكن للشركات تقليل فرص الأعطال.",
        "تحسين الأداء: يمكن أن تساعد صيانة معدات تكنولوجيا المعلومات الشركات على تحسين أداء معداتها.",
        "توفير المال: يمكن أن تساعد صيانة معدات تكنولوجيا المعلومات الشركات على توفير المال عن طريق تقليل الحاجة إلى شراء أجهزة جديدة أو إصلاح الأجهزة القديمة.",
        "تحسين أمان البيانات: يمكن أن تساعد صيانة معدات تكنولوجيا المعلومات الشركات على تحسين أمان بياناتها عن طريق تحديث برامج الجهاز وأنظمة التشغيل.",
      ],
    },
  ];
  return (
    <Section>
      <Container>
        <Box py={5} sx={{ direction: "rtl" }}>
          {paragraphs.map((p) => (
            <Box key={p.id}>
              <Typography variant="h5" color={"white"}>
                {p.title}
              </Typography>
              <ul>
                {p.points.map((point, index) => (
                  <li key={index}>
                    <Typography>{point}</Typography>
                  </li>
                ))}
              </ul>
            </Box>
          ))}
        </Box>
      </Container>
    </Section>
  );
};

export default NetworkFour;
