import React from "react";
import Section from "@/templates/Section";
import { Box, Container, Typography } from "@mui/material";

const CallFour = () => {
  const paragraphs = [
    {
      id: 1,
      purpleText: "تركيب وتمديد هواتف الشبكة",
      title: "أهم مميزات مركز الاتصال:",
      points: [
        "تحسين جودة المكالمات: يوفر هاتف الشبكة جودة صوت أفضل من الهاتف التقليدي، مما يحسن التواصل بين الموظفين والعملاء.",
        "تقليل التكاليف: يمكن أن يساعد هاتف الشبكة في تقليل التكاليف عن طريق تقليل تكلفة المكالمات وتقليل الحاجة إلى الصيانة.",
        "زيادة الإنتاجية: يمكن أن يساعد هاتف الشبكة على زيادة الإنتاجية من خلال توفير ميزات مثل النقل المجمع والرد الآلي والرسائل الصوتية والبريد الإلكتروني.",
        "قائمة الانتظار: توفر قائمة مرتبة ومجدولة للملاحق الحالية، أي إذا كان عدد الاتصالات الآن أكثر من عدد الموظفين الحاليين، فسيتم إدخال باقي المكالمات في مرحلة الانتظار، وبمجرد الانتهاء من ذلك عندما يصبح الموظف متاحًا، سيتم إدخال المكالمات بطريقة منظمة.",
        "تحسين الأمان: يمكن أن يساعد هاتف الشبكة في تحسين الأمان من خلال توفير ميزات مثل التشفير والتعرف الثنائي.",
        "تحسين المرونة: يمكن أن تساعد الاتصالات الهاتفية عبر الشبكة في تحسين المرونة من خلال السماح للموظفين بالعمل من أي مكان.",
      ],
      text: "يعد هاتف الشبكة بديلاً رائعًا لهاتف الشركة التقليدي. توفر الاتصالات الهاتفية عبر الشبكة العديد من الفوائد التي يمكن أن تساعد الشركات على تحسين جودة الاتصال بين أعضاء النظام، وتقليل التكاليف، وزيادة الإنتاجية، وتحسين الأمان، وتحسين المرونة.",
    },
    {
      id: 2,
      purpleText: "خدمة مركز الاتصال",
      title: "أهم مميزات مركز الاتصال:",
      points: [
        "نظام الرد الصوتي التفاعلي (IVR).",
        "تحديد أوقات العمل",
        "تقسيم ساعات العمل",
        "خاصية تحويل المكالمات",
        "خاصية تقييم الكلام",
      ],
      text: "",
    },
    {
      id: 3,
      purpleText: "",
      title:
        "يوفر مجموعة من الأدوات والميزات لتحسين إدارة وأداء مراكز الاتصال. ومن هذه الأدوات:",
      points: [
        "الرد التلقائي على المكالمات: تتضمن ميزة الرد التلقائي إمكانية توجيه المكالمات الواردة تلقائيًا إلى القسم أو العامل المناسب في المركز.",
        "تحويل المكالمات الذكي: يتيح تحويل المكالمات الذكي توجيه المكالمات بناءً على أولويات أو قواعد محددة مسبقًا، مما يحسن تجربة المتصلين ويوجههم إلى الشخص المناسب لمساعدتهم.",
        "التحليلات والتقارير: توفر أدوات التحليلات وإعداد التقارير تقارير مفصلة عن أداء المركز وأداء الموظفين، مما يساعد في تحديد نقاط القوة ونقاط التحسين واتخاذ القرارات الإستراتيجية.",
        "إدارة شؤون الموظفين: تتضمن إدارة شؤون الموظفين أدوات لتخطيط وجدولة جداول العمل، وتوزيع المكالمات بين الموظفين، ومراقبة وتقييم أداء الموظفين.",
        "التكامل مع الأنظمة الأخرى: تتيح CCaaS التكامل مع الأنظمة الأخرى في المؤسسة، مثل أنظمة إدارة علاقات العملاء (CRM) وأنظمة إدارة البيانات، لتوفير تجربة متكاملة وفعالة للمتصلين.",
        "توفر خدمة إدارة مراكز الاتصال في السحابة العديد من المزايا، مثل التكلفة المنخفضة والمرونة والإتاحة العالية، وتسمح للمؤسسات بتحسين كفاءة وأداء مراكز الاتصال وتحسين تجربة المتصلين.",
      ],
      text: "",
    },
    {
      id: 4,
      purpleText: "",
      title: "أهم مميزات مركز الاتصال:",
      points: [
        "تحسين الكفاءة: يمكن أن تساعد إدارة مركز الاتصال في تحسين الكفاءة من خلال أتمتة المهام المتكررة، مثل الرد على المكالمات والتوجيه إلى الموظفين المناسبين.",
        "توفير الوقت والمال: يمكن لإدارة مركز الاتصال أن تساعد في توفير الوقت والمال عن طريق تقليل الحاجة إلى الموظفين والبنية التحتية المادية.",
        "تحسين تجربة العملاء: يمكن أن تساعد إدارة مركز الاتصال في تحسين تجربة العملاء من خلال توفير خدمة عملاء أكثر استجابة وكفاءة.",
        "زيادة رضا العملاء: يمكن أن تساعد إدارة مركز الاتصال في زيادة رضا العملاء من خلال توفير خدمة عملاء أكثر استجابة وكفاءة.",
      ],
      text: "",
    },
    {
      id: 5,
      purpleText: "",
      title:
        "إن إدارة مراكز الاتصال من قبل فريق محترف يتمتع بالخبرة والكفاءة لها أهمية كبيرة للأسباب التالية:",
      points: [
        "تحسين تجربة المتصلين: يساعد فريق إدارة مركز الاتصال المحترف على تحسين تجربة المتصلين. ويتم تدريب أعضاء الفريق على كيفية التعامل مع المتصلين بطريقة احترافية وودودة، وتقديم الدعم والمساعدة المطلوبة بكفاءة وفعالية.",
        "زيادة الكفاءة والإنتاجية: يعمل فريق إدارة مركز الاتصال المحترف على زيادة الكفاءة والإنتاجية في المركز. يتم تنظيم العمل وتوزيع المهام بشكل مناسب وتحسين عمليات الرد على المكالمات والتحويلات وإدارة الوقت مما يساهم في زيادة الكفاءة وتحقيق أهداف المركز.",
        "تحسين جودة الخدمة: يعمل فريق إدارة مركز الاتصال المحترف على تحسين جودة الخدمة المقدمة للعملاء. يتم تدريب أعضاء الفريق على مهارات الاتصال الفعال وحل المشكلات والتعامل مع المواقف الصعبة، مما يساعد في تقديم خدمة عالية الجودة ورضا العملاء.",
        "تحقيق الأهداف التجارية: يعمل فريق إدارة مركز الاتصال المحترف على تحقيق الأهداف التجارية للمنظمة. يتعاون أعضاء الفريق مع الإدارة العليا والإدارات الأخرى في المؤسسة لتحقيق أهداف المبيعات والتسويق وخدمة العملاء وغيرها من الأهداف، والمساهمة في تحقيق نتائج إيجابية وزيادة الإيرادات.",
        "التحليل والتقييم: يقوم فريق إدارة مركز الاتصال المحترف بتحليل وتقييم أداء المركز والموظفين. يتم جمع البيانات وتحليلها لتحديد نقاط القوة ونقاط التحسين، واتخاذ الإجراءات اللازمة لتحسين الأداء وتحقيق الأهداف المحددة.",
      ],
      text: "",
    },
  ];
  return (
    <Section>
      <Container>
        <Box py={5} sx={{ direction: "rtl" }}>
          {paragraphs.map((p) => (
            <Box key={p.id} mb={5}>
              <Typography variant="h4" color={"secondary"}>
                {p.purpleText}
              </Typography>
              <Typography variant="h5" color={"white"}>
                {p.title}
              </Typography>
              <ul>
                {p.points.map((point, index) => (
                  <li key={index}>
                    <Typography>{point}</Typography>
                  </li>
                ))}
              </ul>
              <Typography>{p.text}</Typography>
            </Box>
          ))}
        </Box>
      </Container>
    </Section>
  );
};

export default CallFour;
