import React from "react";
import CenteredSection from "@/templates/CenteredSection";

const Backup = () => {
  const section = {
    title: "خدمات النسخ الاحتياطي",
    description:
      "إيمانًا منا بأهمية معلومات عملائنا، فإننا نقدم لهم خدمة النسخ الآمنة سواء داخل شبكتهم المحلية أو الشبكة السحابية. ومع رقمنة العديد من العمليات، أصبحت البيانات سلعة ثمينة بشكل متزايد. هناك بيانات رقمية أكثر بكثير من البيانات التناظرية، مما يعني أنها يمكن أن تقع بسهولة في الأيدي الخطأ. وبالتالي، فإن أمن البيانات هو موضوع يجب النظر إليه بقوة. إن وجود صورة شخصية في الأيدي الخطأ يشبه وضع معلومات العميل في الأيدي الخطأ. ولضمان أمن البيانات، يتم تنفيذ إجراءات مثل النسخ الاحتياطي للبيانات والتشفير",
  };
  return (
    <CenteredSection title={section.title} description={section.description} />
  );
};

export default Backup;
