import React from "react";
import { Box, Container, Grid, Typography } from "@mui/material";

const BackupTwo = () => {
  return (
    <section>
      <Container>
        <Box py={5} sx={{ direction: "rtl" }}>
          <Grid container spacing={5}>
            <Grid
              item
              xs={12}
              sm={6}
              display={"flex"}
              flexDirection={"column"}
              justifyContent={"center"}
            >
              <Typography variant="h6" mb={3}>
                ماذا يعني النسخ الاحتياطي للبيانات؟ النسخ الاحتياطي للبيانات
                يعني إنشاء وتخزين نسخ إضافية من البيانات بشكل منفصل. ال فكرة
                النسخ الاحتياطي للبيانات هي التأكد من أنه في حالة حدوث ذلك حادث،
                واحد لديه نسخة إضافية من البيانات. الأبحاث لديها أظهرت أن الكثير
                من الشركات واجهت مشاكل لأنها لم تقم بعمل نسخة احتياطية من
                البيانات التي فقدتها. الأضرار الناجمة عن فقدان البيانات أو يمكن
                التحكم في السرقة بشكل أفضل عندما يكون لدى المنظمة نسخة إضافية من
                البيانات المفقودة تمكنه من الاستمرار في عمله عمليات. هناك عوامل
                مختلفة تسبب فقدان البيانات، البيانات النسخ الاحتياطي يحمي
                البيانات من التأثيرات الضارة لفقدان البيانات. منذ النسخ
                الاحتياطي للبيانات يعني ببساطة إنشاء نسخة إضافية من الملف
                البيانات، يمكن إجراء النسخ الاحتياطي للبيانات بعدة طرق تتراوح من
                مسح مستند ضوئيًا إلى تخزين المستند في السحابة. تنقسم طرق النسخ
                الاحتياطي للبيانات بشكل عام إلى تقليدية و أساليب غير تقليدية.
                تتضمن الطرق التقليدية تخزين البيانات على محرك أقراص خارجي. الطرق
                غير التقليدية للنسخ الاحتياطي للبيانات تشمل التخزين السحابي.
              </Typography>
            </Grid>
            <Grid item xs={12} sm={6}>
              <Box>
                <img
                  src="/images/it_services.png"
                  alt="it_services"
                  width={"100%"}
                />
              </Box>
            </Grid>
          </Grid>
        </Box>
      </Container>
    </section>
  );
};

export default BackupTwo;
