import React from "react";
import Section from "@/templates/Section";
import { Box, Container, Typography } from "@mui/material";

const BackupFour = () => {
  const paragraphs = [
    {
      id: 1,
      title: "تعرف على برنامج Veeam للنسخ الاحتياطي والنسخ المتماثل",
      points: [
        "النسخ الاحتياطي السحابي الأصلي مدمج لـ AWS وAzure وGoogle",
        "حماية موثوقة من برامج الفدية",
        "الحماية المستمرة للبيانات (CDP)",
        "زيادة الأمن السحابي",
      ],
      text: "",
    },
    {
      id: 2,
      title: "أنواع فييم",
      points: [
        "Cloud وVirtual وphysic وSaaS وKubernetes وVMware وHyper-V وWindows وLinux وUNIX وNAS وAWS وAzure وEnterprise Apps والمزيد.",
        "مجموعة توافر Veeam.",
        "النسخ الاحتياطي والنسخ المتماثل Veeam.",
        "توفر هذه الوظيفة الإضافية لبرنامج Veeam Backup & Replication تنسيقًا لاسترداد الموقع بنقرة واحدة، واختبار DR، وتوثيق النسخ الاحتياطية.",
      ],
      text: "",
    },
    {
      id: 3,
      title:
        "يعد Veeam Backup & Replication المنتج الرئيسي لشركة Veeam وهو عبارة عن حل شامل للنسخ الاحتياطي واستعادة البيانات. يتم استخدامه على نطاق واسع من قبل الشركات والمؤسسات لحماية البيانات وضمان الاسترداد السريع والسهل. فيما يلي بعض الميزات الرئيسية لبرنامج Veeam Backup & Replication:",
      points: [
        "النسخ الاحتياطي المتقدم: يوفر Veeam Backup & Replication نسخًا احتياطية كاملة ومتزامنة وتقدمية للبيانات. يمكنك تكوين جداول النسخ الاحتياطي، وتحديد مستويات الاحتفاظ بالنسخ الاحتياطي، وتحديد البيانات التي سيتم نسخها.",
        "الاسترداد السريع: يتيح برنامج Veeam Backup & Replication استعادة البيانات بسرعة وكفاءة. يمكنك استعادة الملفات والمجلدات والأجهزة الافتراضية من النسخ الاحتياطية بسهولة وسرعة.",
        "التوافق والتكامل: يدعم Veeam Backup & Replication مجموعة واسعة من البيئات والتقنيات المختلفة. يدعم VMware vSphere، وMicrosoft Hyper-V، وNutanix AHV، والعديد من التقنيات الأخرى.",
        "استرداد فعال من حيث التكلفة: يساعد برنامج Veeam Backup & Replication على تحقيق استرداد فعال من حيث التكلفة من خلال ضغط البيانات والتخزين المتقدم وإدارة السعة. يمكنك تحسين استخدام مساحة التخزين وتقليل تكاليف التخزين.",
        "الحماية الشاملة: يوفر Veeam Backup & Replication خيارات لحماية البيانات الشاملة، بما في ذلك النسخ الاحتياطي متعدد المواقع، والتعافي من الكوارث، والتكوينات عالية التوفر.",
      ],
      text: "يعد Veeam Backup & Replication منتجًا قويًا وموثوقًا يوفر حماية واستعادة البيانات بسهولة وفعالية. قم بتحديث حماية بياناتك وتخلص من أوقات التوقف عن العمل باستخدام حل بسيط ومرن وموثوق وقوي لحماية أحمال العمل السحابية وSaaS والأحمال الافتراضية والمادية. Veeam النسخ الاحتياطي لبرنامج Microsoft 365. تخلص من مخاطر فقدان الوصول إلى بيانات Microsoft 365 والتحكم فيها من خلال النسخ الاحتياطي القابل للتوسع للمؤسسات الكبيرة.",
    },
    {
      id: 4,
      title:
        "Veeam Backup for Microsoft Office 365 هو منتج من Veeam يوفر حل النسخ الاحتياطي والاستعادة لبريد Microsoft Office 365 وSharePoint وOneDrive for Business. ويهدف إلى حماية البيانات المخزنة في بيئة Microsoft Office 365 وتوفير استرداد سريع وموثوق عند الحاجة. فيما يلي بعض الميزات الرئيسية لبرنامج Veeam Backup لـ Microsoft Office 365:",
      points: [
        "النسخ الاحتياطي الشامل: يتيح Veeam Backup لـ Microsoft Office 365 إجراء نسخ احتياطي شامل لبيانات Office 365 الخاصة بك، بما في ذلك البريد الإلكتروني والمرفقات وجهات الاتصال والتقويمات والمهام والملفات في SharePoint وOneDrive for Business.",
        "الاسترداد المرن: يمكنك استعادة البيانات المحددة بدقة وفقًا لاحتياجاتك. يوفر Veeam Backup for Microsoft Office 365 خيارات استعادة متعددة، بما في ذلك الاستعادة الفردية للعناصر المحددة والاستعادة المجمعة والاستعادة الكاملة للمستخدم.",
        "الحماية الشاملة: يوفر Veeam Backup لـ Microsoft Office 365 حماية شاملة للبيانات من خلال النسخ الاحتياطي متعدد المواقع، والاحتفاظ بالنسخ الاحتياطي على المدى الطويل، والتحقق من صحة البيانات المحفوظة.",
        "سهولة الاستخدام: يتميز Veeam Backup لـ Microsoft Office 365 بواجهة مستخدم بديهية وسهلة الاستخدام. قم بتكوين جداول النسخ الاحتياطي، وحدد سياسات الاحتفاظ بالنسخ الاحتياطي، وإدارة عمليات الاستعادة بسهولة.",
        "استرداد سريع وموثوق: يتيح Veeam Backup لـ Microsoft Office 365 استعادة البيانات بسرعة وموثوقية عند الحاجة. استعادة البيانات بدقة وسرعة للمستخدمين الفرديين أو المجموعات أو المستأجر بأكمله.",
      ],
      text: "يعد Veeam Backup for Microsoft Office 365 حلاً قويًا وفعالاً لحماية واستعادة بيانات Microsoft Office 365 بسهولة وأمان. Veeam النسخ الاحتياطي لSalesforce. Veeam Backup for Salesforce v2 هو حل لحماية البيانات مصمم خصيصًا لبيئات Salesforce. فهو يوفر إمكانات شاملة للنسخ الاحتياطي والاسترداد والاحتفاظ ببيانات Salesforce، مما يضمن حماية معلومات الأعمال المهمة وإمكانية استعادتها بسهولة إذا لزم الأمر.",
    },
    {
      id: 5,
      title:
        "تتضمن الميزات الرئيسية لبرنامج Veeam Backup for Salesforce v2 ما يلي:",
      points: [
        "النسخ الاحتياطي والاسترداد: يوفر الحل نسخًا احتياطية يومية تلقائية لبيانات Salesforce الخاصة بك، بما في ذلك الكائنات القياسية والمخصصة والمرفقات وبيانات التعريف. فهو يتيح الاسترداد الدقيق للسجلات الفردية أو الكائنات أو مثيلات Salesforce بأكملها، مما يسمح للمؤسسات باسترداد البيانات بسرعة في حالة الحذف غير المقصود أو تلف البيانات أو مشكلات أخرى.",
        "سياسات الاحتفاظ: يسمح Veeam Backup for Salesforce v2 للمؤسسات بتحديد سياسات احتفاظ مرنة للنسخ الاحتياطية الخاصة بـ Salesforce. ويضمن ذلك الاحتفاظ بالبيانات للفترة الزمنية المطلوبة وتلبية متطلبات الامتثال.",
        "تصدير البيانات: يتيح الحل تصدير بيانات Salesforce إلى مواقع التخزين الخارجية، مما يوفر طبقة إضافية من الحماية ويسمح للمؤسسات بالحصول على نسخة من بياناتها خارج منصة Salesforce.",
        "الأمان والامتثال: يضمن Veeam Backup for Salesforce v2 أمان وسلامة البيانات المدعومة من خلال استخدام التشفير وعناصر التحكم في الوصول الآمن. يساعد المؤسسات على تلبية متطلبات الامتثال التنظيمي من خلال توفير حل موثوق للنسخ الاحتياطي والاسترداد. الأمان والامتثال: يضمن Veeam Backup for Salesforce v2 أمان وسلامة البيانات المدعومة من خلال استخدام التشفير وعناصر التحكم في الوصول الآمن. يساعد المؤسسات على تلبية متطلبات الامتثال التنظيمي من خلال توفير حل موثوق للنسخ الاحتياطي والاسترداد.",
        "الأتمتة والجدولة: يوفر الحل إمكانات الأتمتة والجدولة، مما يسمح للمؤسسات بإعداد مهام نسخ احتياطي منتظمة وتحديد نوافذ نسخ احتياطي محددة تتوافق مع احتياجات أعمالهم.",
        "إعداد التقارير والمراقبة: يوفر Veeam Backup for Salesforce v2 إمكانات إعداد تقارير ومراقبة مفصلة، مما يمنح المؤسسات رؤية واضحة لعمليات النسخ الاحتياطي والاسترداد. ويساعد ذلك في تتبع حالة النسخ الاحتياطية وتحديد أي مشكلات وضمان الامتثال لحماية البيانات.",
      ],
      text: "تم تصميم Veeam Backup for Salesforce v2 لتبسيط وتبسيط عملية النسخ الاحتياطي والاسترداد لبيئات Salesforce، مما يوفر راحة البال ويضمن حماية بيانات الأعمال الهامة واستعادتها. Veeam Data Platform هو حل شامل لإدارة البيانات وحمايتها تقدمها Veeam. وهو مصمم لمواجهة تحديات إدارة وحماية البيانات عبر بيئات سحابية وسحابية هجينة متعددة. توفر منصة Veeam Data Platform نهجًا موحدًا لإدارة البيانات، مما يمكّن المؤسسات من إجراء نسخ احتياطي لبياناتها واستعادتها وتحليلها بشكل آمن.",
    },
  ];

  return (
    <Section>
      <Container>
        <Box py={5} sx={{ direction: "rtl" }}>
          {paragraphs.map((p) => (
            <Box key={p.id} mb={5}>
              <Typography variant="h5" color={"white"}>
                {p.title}
              </Typography>
              <ul>
                {p.points.map((point, index) => (
                  <li key={index}>
                    <Typography>{point}</Typography>
                  </li>
                ))}
              </ul>
              <Typography>{p.text}</Typography>
            </Box>
          ))}
        </Box>
      </Container>
    </Section>
  );
};

export default BackupFour;
