import LtrSection from "@/templates/LtrSection";
import { Box } from "@mui/material";
import React from "react";

const AITwo = () => {
  const section = {
    description:
      "يتمتع الذكاء الاصطناعي بالقدرة على إحداث ثورة في العديد من المجالات، بما في ذلك الرعاية الصحية والتصنيع والتمويل والنقل والتعليم. يمكن أن يساعدنا الذكاء الاصطناعي في حل بعض التحديات الأكثر إلحاحًا في العالم، مثل تغير المناخ والمرض والفقر. يمتلك الذكاء الاصطناعي القدرة على إحداث ثورة في العديد من المجالات، ولكن هناك أيضًا بعض المخاوف بشأن التأثيرات المحتملة للذكاء الاصطناعي. على سبيل المثال، هناك مخاوف من أن الذكاء الاصطناعي قد يؤدي إلى فقدان الوظائف، وأنه يمكن استخدامه لأغراض ضارة، مثل تطوير الأسلحة المدمرة. من المهم أن نتذكر أن الذكاء الاصطناعي هو أداة، ويمكن استخدامه للخير أو للشر. تقع على عاتقنا مسؤولية ضمان استخدام الذكاء الاصطناعي بطريقة مسؤولة وأخلاقية",
    imgUrl: "/images/ai.png",
    hasBtn: false,
  };
  return (
    <Box sx={{ direction: "rtl" }}>
      <LtrSection
        description={section.description}
        imgUrl={section.imgUrl}
        hasBtn={false}
      />
    </Box>
  );
};

export default AITwo;
