import React from "react";
import Section from "@/templates/Section";
import { Box, Container, Typography } from "@mui/material";

const VpnFour = () => {
  const paragraphs = [
    {
      id: 1,
      title: "مميزات خدمة فرع VPN",
      points: [
        "تقديم أفضل وأنسب المعلومات والمقترحات.",
        "الدعم الفني على مدار الساعة.",
        "ربط جميع فروع المؤسسة على شبكة واحدة.",
        "لا توجد رسوم على الدواء بالإضافة إلى تخفيض رسوم مقدم الخدمة.",
        "ميزانية.",
        "اتصال أحادي الاتجاه أو ثنائي الاتجاه بين الإدارة والفروع.",
        "إمكانية استخدام جميع أنواع الاتصالات للاتصال (FTTH/ADSL/VDSL/4G/3G).",
        "إمكانية إضافة خط إنترنت احتياطي لضمان استمرارية العمل وعدم انقطاعه مع إمكانية دمج السرعة.",
        "إمكانية ربط كافة الموظفين بالخادم الرئيسي للمؤسسة والعمل على كافة البرامج.",
        "ربط جميع أجهزة الموظفين ببعضها البعض في جميع الفروع ومشاركة الملفات والطابعات فيما بينهم.",
        "توزيع السرعات والصلاحيات على الموظفين.",
        "ربط الشبكة المركزية بجميع الفروع (ip-Phone).",
        "استخدام أحد هواتف المنشأة من خارجها.",
        "استخدام هاتف أي فرع مع فرع آخر والعكس.",
        "ربط كاميرات المراقبة ومتابعتها من أي مكان.",
      ],
    },
  ];
  return (
    <Section>
      <Container>
        <Box py={5} sx={{ direction: "rtl" }}>
          <Typography variant="h5" color={"white"} mb={2}>
            أهمية ربط الفروع بشبكة VPN
          </Typography>
          <Typography mb={5}>
            حيث أن موضوعنا هو ربط الفروع باستخدام VPN مع الزيادة توسع الشركات
            والحاجة الملحة لمشاركة المشاريع الموارد مثل الملفات والبيانات
            ومعلومات المؤسسة، على وجه الخصوص إمكانية الوصول عن بعد، وهنا الأهمية
            القصوى ل يظهر استخدام VPN أيضًا لأنه أكثر أمانًا وأقل تكلفة
            بالمقارنة مع IP ثابت.
          </Typography>
          {paragraphs.map((p) => (
            <Box key={p.id}>
              <Typography variant="h5" color={"white"}>
                {p.title}
              </Typography>
              <ul>
                {p.points.map((point, index) => (
                  <li key={index}>
                    <Typography>{point}</Typography>
                  </li>
                ))}
              </ul>
            </Box>
          ))}
        </Box>
      </Container>
    </Section>
  );
};

export default VpnFour;
